cf_billing/InformationRegisters/бестСвязьДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестСвязьДоговоров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СвязанныйДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОснованиеДляДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестСвязьДоговоров/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область РегистрацияДанных

Процедура ДобавитьЗапись(ДанныеДляЗаписи) Экспорт
	
	ЗаполненыДанныедляЗаписи = ЗначениеЗаполнено(ДанныеДляЗаписи.ИсточникДоговора) И ЗначениеЗаполнено(ДанныеДляЗаписи.ДоговорСсылка);
	
	Если ЗаполненыДанныедляЗаписи Тогда				
		МенеджерЗаписи = РегистрыСведений.бестСвязьДоговоров.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ОснованиеДляДоговора = ДанныеДляЗаписи.ИсточникДоговора;
		МенеджерЗаписи.СвязанныйДоговор = ДанныеДляЗаписи.ДоговорСсылка;
		МенеджерЗаписи.Записать();
	КонецЕсли;	     

КонецПроцедуры

#КонецОбласти

#Область ПолучениеДанных

Процедура ПолучитьДанные(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема = Новый СхемаЗапроса;
		Пакет = Схема.ПакетЗапросов[0];		
	Иначе
		Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаАктуальныеДанные());
	Пакет.ТаблицаДляПомещения = ТаблицаДляПомещения;
	Пакет.ВыбиратьРазрешенные = ?(ПараметрыОтбора.Свойство("ВыбиратьРазрешенные") и НЕ ПараметрыОтбора.ВыбиратьРазрешенные, ЛОЖЬ, ИСТИНА);
	ОператорВыбора = Пакет.Операторы[0];	
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		
		Отбор 						= ОператорВыбора.Отбор;
		ИмяТаблицыОтбор				= "ТаблицаИнформации";
		ДоступныеПараметры 			= "ОснованиеДляДоговора, СвязанныйДоговор";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(Отбор, ИмяТаблицыОтбор, ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДанныеПоОтбору(Ссылка, ИмяРеквизита, СозданоНаОсновании = Истина) Экспорт
	
	Схема = Неопределено;
	ПараметрыВТ = Новый Массив;
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура(ИмяРеквизита, ИмяРеквизита)));
		
	ПараметрыОтбора = Новый Структура("ПараметрыВТ", ПараметрыВТ);
	ПараметрыЗапроса = Новый Структура(ИмяРеквизита, Ссылка);
	
	ПолучитьДанные(Схема, ПараметрыОтбора);	
	
    Возврат энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса);
	
КонецФункции

#Область ТекстЗапроса

Функция ТекстЗапросаАктуальныеДанные()
	
	Текст =
	"ВЫБРАТЬ
	|	ТаблицаИнформации.ОснованиеДляДоговора КАК ОснованиеДляДоговора,
	|	ТаблицаИнформации.СвязанныйДоговор КАК СвязанныйДоговор
	|ИЗ
	|	РегистрСведений.бестСвязьДоговоров КАК ТаблицаИнформации";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецОбласти	

#КонецОбласти

#КонецЕсли
